Revit 2024 API
BuiltInFailures.SketchFailures.NoPlane Property
 Highlighted geometry no longer determines a plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoPlane { get; }
Visual Basic
Public Shared ReadOnly Property NoPlane As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoPlane {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace